
&НаКлиенте
Процедура ТестВопросовЛапша(Команда)
	
КонецПроцедуры

&НаКлиенте
Процедура ТестВопросовКонвейер(Команда)
	
	ОчиститьСообщения();
	
	Коза = КонвейерЗаданийКлиент;
	
	// Коробка, которая двигается по конвейеру через все этапы (см. КонтекстЗадания.Переменные)
	Переменные = Новый Структура;
	Переменные.Вставить("Ответ", Ложь);
	
	// Обработчик ошибок, возникших на конвейере
	ОбработчикОшибок = Коза.ОбработчикОшибок("ОбработчикОшибок", ЭтотОбъект);
	
	ОбработчикРеакцииНаВопрос = Новый ОписаниеОповещения("ОбработатьРеакциюНаВопрос", ЭтотОбъект, Переменные);
	
	// Формирование этапов конвейера и запуск
	
	Отладка = Истина;
	
	Сценарий = Коза.СоздатьСценарий(Отладка);
	
	Коза.ДиалогВопроса(Сценарий, ОбработчикРеакцииНаВопрос, "Вам нравится коза?", РежимДиалогаВопрос.ДаНетОтмена);
	Коза.Оператор_Если(Сценарий, "ПроверкаОтвета", ЭтотОбъект, КодВозвратаДиалога.Да);
		Коза.ПроизвольноеЗадание(Сценарий, "ЗаданиеОтвет", ЭтотОбъект, "Ответ: Да");
		Коза.Оператор_Если(Сценарий, "ПроверкаОтвета", ЭтотОбъект, КодВозвратаДиалога.Да);
			Коза.ПроизвольноеЗадание(Сценарий, "ЗаданиеОтвет", ЭтотОбъект, "Ответ: Да!");
		Коза.Оператор_КонецЕсли(Сценарий);
	Коза.Оператор_ИначеЕсли(Сценарий, "ПроверкаОтвета", ЭтотОбъект, КодВозвратаДиалога.Нет);
		Коза.ПроизвольноеЗадание(Сценарий, "ЗаданиеОтвет", ЭтотОбъект, "Ответ: Нет");	
	Коза.Оператор_ИначеЕсли(Сценарий, "ПроверкаОтвета", ЭтотОбъект, КодВозвратаДиалога.Отмена);
		Коза.ПроизвольноеЗадание(Сценарий, "ЗаданиеОтвет", ЭтотОбъект, "Ответ: Отмена");	
	Коза.Оператор_Иначе(Сценарий);	
		Коза.ПроизвольноеЗадание(Сценарий, "ЗаданиеОтвет", ЭтотОбъект, "Что-то пошло не так");
	Коза.Оператор_КонецЕсли(Сценарий);
	Коза.НачатьВыполнение(Сценарий, Переменные, ОбработчикОшибок);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработатьРеакциюНаВопрос(Результат, Переменные) Экспорт
	
	Переменные.Ответ = Результат;
	
КонецПроцедуры

&НаКлиенте
Функция ПроверкаОтвета(Переменные, ОжидаемыйОтвет) Экспорт
	
	Возврат Переменные.Ответ = ОжидаемыйОтвет;
	
КонецФункции

&НаКлиенте
Процедура ЗаданиеОтвет(Переменные, Текст) Экспорт
	
	Сообщить(Текст);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработчикОшибок(КонтекстОшибки, ДополнительныеПараметры) Экспорт
	
	Сообщить(СтрШаблон("Ошибка: Текст = ""%1""; НужноПоздороваться = ""%2""", КраткоеПредставлениеОшибки(КонтекстОшибки.ИнформацияОбОшибке), КонтекстОшибки.Переменные.НужноПоздороваться));
		
КонецПроцедуры

