
&НаКлиенте
Процедура ТестВопросовЛапша(Команда)
	
КонецПроцедуры

&НаКлиенте
Процедура ТестВопросовКонвейер(Команда)
	
	ОчиститьСообщения();
	
	Конвейер = КонвейерЗаданийКлиент;
	
	// Коробка, которая двигается по конвейеру через все этапы (см. КонтекстЗадания.ОбщиеПараметры)
	ОбщиеПараметры = Новый Структура;
	ОбщиеПараметры.Вставить("НужноПоздоровоться", Ложь);
	
	// Обработчик ошибок, возникших на конвейере
	ОбработчикОшибок = Конвейер.ОбработчикОшибок("ОбработчикОшибок", ЭтотОбъект);
	
	// Формирование этапов конвейера и запуск (в стиле fluent)
	
	Линия = Конвейер.СоздатьЛинию();
	
	Конвейер.ЭтапПоказатьВопрос(
		Линия,
		КонвейерЗаданийКлиент.ПроизвольныйОбработчик2("ОбработатьРеакциюНаВопрос", ЭтотОбъект, ОбщиеПараметры),
		"Поздороваться?",
		РежимДиалогаВопрос.ДаНет
	);
	
	Конвейер.ЭтапНачалоУсловногоБлока(Линия, "ПроверкаУсловия", ЭтотОбъект, ОбщиеПараметры);
	
		Конвейер.ЭтапПроизвольноеЗадание(
			Линия,
			"ЗаданиеПриветствие",
			ЭтотОбъект,
			ОбщиеПараметры
		);
		
	Конвейер.ЭтапОкончаниеУсловногоБлока(Линия);
	
	Конвейер.Пуск(
		Линия,
		ОбработчикОшибок,
		Неопределено,
		ОбщиеПараметры,
		"Обработка.Тест2.Форма.ТестВопросовКонвейер"
	);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработатьРеакциюНаВопрос(Результат, ОбщиеПараметры) Экспорт
	
	Если Результат = КодВозвратаДиалога.Да Тогда
		
		ОбщиеПараметры.НужноПоздоровоться = Истина;
		
	КонецЕсли; 
	
КонецПроцедуры

&НаКлиенте
Процедура ПроверкаУсловия(Результат, ОбщиеПараметры) Экспорт
	
	Результат = ОбщиеПараметры.НужноПоздоровоться;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаданиеПриветствие(Результат, ОбщиеПараметры) Экспорт
	
	Сообщить("Привет!");
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработчикОшибок(КонтекстОшибки, ДополнительныеПараметры) Экспорт
	
	Сообщить(СтрШаблон("Ошибка: Текст = ""%1""; НужноПоздоровоться = ""%2""", КраткоеПредставлениеОшибки(КонтекстОшибки.ИнформацияОбОшибке), КонтекстОшибки.ОбщиеПараметры.НужноПоздоровоться));
		
КонецПроцедуры

