
&НаКлиенте
Процедура ТестВопросовЛапша(Команда)
	
КонецПроцедуры

&НаКлиенте
Процедура ТестВопросовКонвейер(Команда)
	
	ОчиститьСообщения();
	
	Конвейер = КонвейерЗаданийКлиент;
	
	// Коробка, которая двигается по конвейеру через все этапы (см. КонтекстЗадания.ОбщиеПараметры)
	ОбщиеПараметры = Новый Структура;
	ОбщиеПараметры.Вставить("Ответ", Ложь);
	
	// Обработчик ошибок, возникших на конвейере
	ОбработчикОшибок = Конвейер.ОбработчикОшибок("ОбработчикОшибок", ЭтотОбъект);
	
	ОбработчикРеакцииНаВопрос = Новый ОписаниеОповещения("ОбработатьРеакциюНаВопрос", ЭтотОбъект, ОбщиеПараметры);
	
	// Формирование этапов конвейера и запуск
	
	Отладка = Истина;
	
	Линия = Конвейер.СоздатьЛинию(Отладка);
	
	Конвейер.ДиалогВопроса(Линия, ОбработчикРеакцииНаВопрос, "Вам нравится коза?", РежимДиалогаВопрос.ДаНетОтмена);
	
	Конвейер.Оператор_Если(Линия, "ПроверкаОтвета", ЭтотОбъект, КодВозвратаДиалога.Да);
	
		Конвейер.ПроизвольноеЗадание(Линия, "ЗаданиеОтвет", ЭтотОбъект, "Ответ: Да");
		
		Конвейер.Оператор_Если(Линия, "ПроверкаОтвета", ЭтотОбъект, КодВозвратаДиалога.Да);
			Конвейер.ПроизвольноеЗадание(Линия, "ЗаданиеОтвет", ЭтотОбъект, "Ответ: Да!");
		Конвейер.Оператор_КонецЕсли(Линия);
		
	Конвейер.Оператор_ИначеЕсли(Линия, "ПроверкаОтвета", ЭтотОбъект, КодВозвратаДиалога.Нет);
	
		Конвейер.ПроизвольноеЗадание(Линия, "ЗаданиеОтвет", ЭтотОбъект, "Ответ: Нет");	
		
	Конвейер.Оператор_ИначеЕсли(Линия, "ПроверкаОтвета", ЭтотОбъект, КодВозвратаДиалога.Отмена);
	
		Конвейер.ПроизвольноеЗадание(Линия, "ЗаданиеОтвет", ЭтотОбъект, "Ответ: Отмена");	
		
	Конвейер.Оператор_Иначе(Линия);	
	
		Конвейер.ПроизвольноеЗадание(Линия, "ЗаданиеОтвет", ЭтотОбъект, "Что-то пошло не так");
	
	Конвейер.Оператор_КонецЕсли(Линия);
	
	Конвейер.НачатьВыполнение(Линия, ОбщиеПараметры, ОбработчикОшибок);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработатьРеакциюНаВопрос(Результат, ОбщиеПараметры) Экспорт
	
	ОбщиеПараметры.Ответ = Результат;
	
КонецПроцедуры

&НаКлиенте
Функция ПроверкаОтвета(ОбщиеПараметры, ОжидаемыйОтвет) Экспорт
	
	Возврат ОбщиеПараметры.Ответ = ОжидаемыйОтвет;
	
КонецФункции

&НаКлиенте
Процедура ЗаданиеОтвет(ОбщиеПараметры, Текст) Экспорт
	
	Сообщить(Текст);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработчикОшибок(КонтекстОшибки, ДополнительныеПараметры) Экспорт
	
	Сообщить(СтрШаблон("Ошибка: Текст = ""%1""; НужноПоздороваться = ""%2""", КраткоеПредставлениеОшибки(КонтекстОшибки.ИнформацияОбОшибке), КонтекстОшибки.ОбщиеПараметры.НужноПоздороваться));
		
КонецПроцедуры

