
&НаКлиенте
Процедура ТестВопросовЛапша(Команда)
	
КонецПроцедуры

&НаКлиенте
Процедура ТестВопросовКонвейер(Команда)
	
	ОчиститьСообщения();
	
	Коза = КонвейерЗаданийКлиент;
	
	// см. параметр "Переменные" в обработчиках заданий
	Переменные = Новый Структура;
	Переменные.Вставить("Ответ", Неопределено);
		
	// Формирование этапов конвейера и запуск
	
	Отладка = Истина;
	
	Сценарий = Коза.СоздатьСценарий(ЭтотОбъект, Переменные, "ОбработчикОшибок", Отладка);
	
	Коза.ДиалогВопроса(Сценарий, "ОбработатьРеакциюНаВопрос", "Вам нравится коза?", РежимДиалогаВопрос.ДаНетОтмена);
	Коза.Оператор_Если(Сценарий, "ПроверкаОтвета", КодВозвратаДиалога.Да);
		Коза.ПроизвольноеЗадание(Сценарий, "ЗаданиеОтвет", "Ответ: Да");
		Коза.Оператор_Если(Сценарий, "ПроверкаОтвета", КодВозвратаДиалога.Да);
			Коза.ПроизвольноеЗадание(Сценарий, "ЗаданиеОтвет", "Ответ: Да!");
		Коза.Оператор_КонецЕсли(Сценарий);
	Коза.Оператор_ИначеЕсли(Сценарий, "ПроверкаОтвета", КодВозвратаДиалога.Нет);
		Коза.ПроизвольноеЗадание(Сценарий, "ЗаданиеОтвет", "Ответ: Нет");	
	Коза.Оператор_ИначеЕсли(Сценарий, "ПроверкаОтвета", КодВозвратаДиалога.Отмена);
		Коза.ПроизвольноеЗадание(Сценарий, "ЗаданиеОтвет", "Ответ: Отмена");	
	Коза.Оператор_Иначе(Сценарий);	
		Коза.ПроизвольноеЗадание(Сценарий, "ЗаданиеОтвет", "Что-то пошло не так");
	Коза.Оператор_КонецЕсли(Сценарий);
	Коза.НачатьВыполнение(Сценарий);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработатьРеакциюНаВопрос(Результат, Переменные) Экспорт
	
	Переменные.Ответ = Результат;
	
КонецПроцедуры

&НаКлиенте
Функция ПроверкаОтвета(Переменные, ОжидаемыйОтвет) Экспорт
	
	Возврат Переменные.Ответ = ОжидаемыйОтвет;
	
КонецФункции

&НаКлиенте
Процедура ЗаданиеОтвет(Переменные, Текст) Экспорт
	
	Сообщить(Текст);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработчикОшибок(КонтекстОшибки, ДополнительныеПараметры) Экспорт
	
	Сообщить(СтрШаблон("Ошибка: Текст = ""%1""; НужноПоздороваться = ""%2""", КраткоеПредставлениеОшибки(КонтекстОшибки.ИнформацияОбОшибке), КонтекстОшибки.Переменные.НужноПоздороваться));
		
КонецПроцедуры

